<?php
return [
    // 流水类型 1 支出 2 收入 3 提现 4 冻结 5 解冻
    'type' => [
        1 => '收入',
        2 => '支出',
        3 => '提现',
        4 => '冻结',
        5 => '解冻',
    ],
    // 资产类型 1 积分 2 学分 3 人民币
    'asset_type' => [
        1 => '支付宝',
        2 => '微信',
        3 => '积分',
        4 => '学分',
    ],
    // 4 学分转赠 5 积分转赠 6 学分提现 7 积分提现
    'trade_type' => [
        11 => '一级积分返利',
        12 => '二级积分返利',
        13 => '三级积分返利',
        21 => '一级代理商返利',
        22 => '二级代理商返利',
        23 => '运营商返利',
        3 => '购买商品',
        4 => '学分转赠',
        5 => '积分转赠',
        6 => '学分提现',
        7 => '积分提现',
        8 => '返利手续费',
        24 => '人工增加积分',
        25 => '人工减少积分',
        26 => '人工增加学分',
        27 => '人工减少学分',
        28 => '学分提现退款',
        29 => '积分提现退款',
    ],
    'poundage' => [
        'withdrawal' => [
            'credit' => 0.13,
            'integral' => 0.05,
        ]
    ]
];